{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science and Mathematics",
      "duration": "2020-2025",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ArupUkil",
  "highlighted_projects": [
    {
      "description": "Created and deployed a social web app on AWS (ECS, ECR, RDS) for writing, sharing, and discussing code in multiple programming languages using Next.js, React, TypeScript, and Tailwind CSS. Implemented a Prisma database schema managed via RESTful APIs with JWT-based authentication. Executed user code in isolated Docker containers to maintain security and enforce resource limits.",
      "git_url": "https://github.com/ArupUkil/Scriptorium",
      "name": "Scriptorium"
    },
    {
      "description": "Worked in a team of six for a University of Toronto partner charity, United for Literacy, to build an app that streamlines the volunteer lifecycle (application and onboarding through to offboarding). Built an in-app quiz in React Native to verify volunteer understanding of volunteering policies. Helped implement group chat by integrating the Django backend API with the frontend, including role-based behaviour for different user types.",
      "git_url": null,
      "name": "United for Literacy Volunteer Mobile App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux cluster monitoring agent that collects server hardware information once and then collects resource-usage metrics at fixed intervals (e.g., every minute). Tested on Rocky Linux 9 (and expected to work on similar distributions). Data is collected via Bash scripts that run standard Linux commands and is persisted in a PostgreSQL database running in a Docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Built a simplified clone of the Linux `grep` command that searches for regex matches across a user-provided file or directory and writes matching lines to an output file. Implemented using Core Java, Lambda/Stream APIs, SLF4J logging, and JUnit tests. Developed with Maven/IntelliJ, with deployment support via Docker for containerisation.",
      "git_url": "/core_java/grep",
      "name": "Grep App"
    },
    {
      "description": "Developed a CLI Java stock trading platform that fetches real-time market data via the Alpha Vantage API and supports buying/selling positions persisted in a PostgreSQL database. Used JDBC for database access, OkHttp for HTTP requests/responses, and JUnit/Mockito/Testcontainers for testing. Emphasised clean architecture (e.g., DAO pattern and REST APIs) and used Jackson Mixins to avoid coupling the application to Alpha Vantage's response schema.",
      "git_url": "/core_java/stockquote",
      "name": "Stock Quote App"
    },
    {
      "description": "Built a Spring Boot trading system for managing traders/accounts, caching Finnhub market quotes in PostgreSQL, and submitting market orders via RESTful CRUD endpoints. Uses a layered (Controller → Service → DAO) architecture with Java 8, Spring Boot, JPA/Hibernate, and Apache HttpClient. Unit tests use Apache DBCP to provision temporary H2 DataSources, and Swagger UI is included for manual API testing.",
      "git_url": "/springboot",
      "name": "Spring Boot Trading App"
    }
  ],
  "name": "Arup Ukil",
  "others": [
    {
      "bullets": [
        "Care Worker, Su-Rekha Care Centre (Night Shift): maintained cleanliness and safety of the care home, assisted residents as needed, and prepared supplies and common areas for the next day.",
        "Assistant Volunteer, Kumon: guided children from preschool to Grade 12 to understand and solve Kumon math and reading work"
      ],
      "title": "Volunteer Work"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed technical and behavioural skills by delivering multiple projects using new tools for each. Built projects including a Linux Cluster Monitoring Agent (Bash, PostgreSQL, Docker), a Java Grep App, and a Spring Boot Trading App. Worked in a Scrum-based process with planning, daily stand-ups, and retrospectives.",
      "duration": "2025-present",
      "title": "Software Developer"
    },
    {
      "company": "SS\u0026C Technologies",
      "description": "Used React and Java Spring Boot to develop a test case queue manager that automates management of test runs on remote machines. Built a website navigation tool using Playwright that generates an HTML page combining a BackstopJS report with an SS\u0026C internal files comparison report. Assisted with an Excel VBA macro to generate Progress 4GL queries for non-technical users. Migrated legacy performance scripts from LoadRunner to JMeter to reduce costs.",
      "duration": "Sept. 2023 - Aug. 2024",
      "title": "Software QA Engineer"
    },
    {
      "company": "iSE Labs",
      "description": "Developed a Python/Flask-based reverse engineering comprehension tool that parses source-code call graphs into root-to-leaf execution paths and applies agglomerative clustering to produce a hierarchical tree representation. Enhanced semantic labelling of cluster nodes using Gensim topic models (Word2Vec/Doc2Vec similarity) and TextRank for more accurate function-name-based annotations. Developed an interactive GoJS frontend to visualise comparisons of execution-path trees across software systems.",
      "duration": "May 2022 - Aug. 2022",
      "title": "Research Assistant"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "C",
      "AWS",
      "Docker",
      "WSL",
      "Postman"
    ],
    "familiar": [
      "Machine Learning",
      "Python ML Libraries (NumPy, TensorFlow, PyTorch, Scikit-learn, Gensim)",
      "Flask",
      "Django",
      "Figma",
      "Jenkins",
      "Jira"
    ],
    "proficient": [
      "React/React Native",
      "Node.js/Next.js",
      "HTML/CSS",
      "TypeScript/JavaScript",
      "C++",
      "Java",
      "Spring Boot",
      "Linux/Bash",
      "PostgreSQL/SQL",
      "Agile/Scrum",
      "Git",
      "REST APIs",
      "Maven"
    ]
  },
  "summary": "I'm a graduate of the University of Toronto, holding a Bachelor of Science degree in Computer Science and Mathematics. I'm a full-stack developer with practical experience from my one-year internship at SS\u0026C Technologies, volunteer work in a small team with the charity United for Literacy, and personal projects. Most of my work and personal projects have used React/React Native for the frontend and backend frameworks such as Next.js, Spring Boot, or Django. C++ is my favourite language, and I have used it since high school for competitive programming and course projects (including a lightweight networking stack and basic computer graphics with OpenGL). I bring substantial hands-on software development experience from my undergraduate studies and early roles, and I'm looking to leverage it in an early-career software engineering position."
}
