{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science and Mathematics",
      "duration": "2020-2025",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ArupUkil",
  "highlighted_projects": [
    {
      "description": "Created and deployed a social web app through AWS ECS, ECR, and RDS where you can write, share, and discuss about code in multiple programming languages using Next.js, React, TypeScript, and Tailwind CSS. Implemented a Prisma database schema which were managed and interacted via RESTful APIs with account authentication (JWT) in the backend infrastructure. Executed user code in isolated containers using Docker to maintain security and enforce limits on computer resource usage.",
      "git_url": "https://github.com/ArupUkil/Scriptorium",
      "name": "Scriptorium"
    },
    {
      "description": "Worked with a team of six for a University of Toronto's partner charity, United for Literacy, to build an app that streamlines the volunteer lifecycle - from the application and onboarding process, through tools that support daily activities, to the final offboarding stage. Used React Native to create an in-app quiz that confirms that the volunteers understand United for Literacy's volunteering policy. Worked with a teammate to set up the group chat functionality - specifically connected the Django backend API with the frontend such that different types of users can be differentiated.",
      "git_url": null,
      "name": "United for Literacy Volunteer Mobile App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring Agent that helps collect information from Linux servers in a cluster. It collects the server hardware information once and then in set intervals (such as every minute) collects the server's resource usage. Tested on Rocky Linux 9 though it may work on other distros. The data is collected by executing bash scripts that run Linux commands and then saving the data in a PostgreSQL database that's run on a Docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Developed a mimic of the Linux `grep` command which allows users to search matching strings from files. The user gives a directory/file to look at and find all in the lines in that directory's files that match the regex the user gives. The resulting lines are put into a user given output file. This tool has been built using Core Java features, Lambda and Stream APIs, SLF4J for logging, and JUnit for testing. Development has been done using Maven and IntelliJ IDE with additional deployment being added by the usage of Docker for containerisation.",
      "git_url": "/core_java/grep",
      "name": "Grep App"
    },
    {
      "description": "Developed a CLI Java stock trading platform that allows users to check real time stock information using the Alpha Vantage API and then potentially buy/sell stock positions that's saved through a PostgresSQL database. This app has been built using Core Java features, SLF4J for logging, JDBC to connect to the PSQL database, OkHttp to send HTTP requests/responses, and JUnit/Mockito/TestContainers for testing. Project architecture was a key focus with the usage of DAO and REST architecture, and Jackson Mixins so the app isn't dependent on the Alpha Vantage API.",
      "git_url": "/core_java/stockquote",
      "name": "Stock Quote App"
    }
  ],
  "name": "Arup Ukil",
  "others": [
    {
      "bullets": [
        "Kumon Teaching Assistant Volunteer: guided children from preschool to 12th grade to understand and solve their Kumon math and reading work"
      ],
      "title": "Volunteer Work"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Trained my technical and behavioural skills through developing multiple software projects using new tools for each. Created projects such as a Linux Clustering Agent (Bash, PostgreSQL, and Docker), Java Grep App, and a Spring Boot Trading App. Developed projects using a Scrum system by having planning meetings, daily stand-ups, and retrospectives through project development.",
      "duration": "2025-present",
      "title": "Software Developer"
    },
    {
      "company": "SS\u0026C Technologies",
      "description": "Used React and Java Spring Boot to develop a new test case queue manager that automates the management of test runs on remote machines. Created a website navigation tool using Playwright that creates a HTML page containing a BackstopJS report and a SS\u0026C internal files comparison tool report. Assisted in developing an Excel VBA macro that allows users to generate Progress 4GL queries without knowledge of Progress. Migrated and updated legacy scripts from LoadRunner to JMeter to eliminate financial expenses in performance testing.",
      "duration": "Sept. 2023 - Aug. 2024",
      "title": "Software QA Engineer"
    },
    {
      "company": "iSE Labs",
      "description": "Developed a Python/Flask based reverse engineering comprehension tool that parses source code call graphs into root-to-leaf execution paths and applies agglomerative clustering to produce a hierarchical tree representation. Enhanced semantic labeling of cluster nodes using Gensim topic models, introducing Word2Vec/Doc2Vec similarity measures, and TextRank for more accurate function name based annotations. Developed an interactive GoJS frontend to visualize comparisons of execution path trees across different software systems.",
      "duration": "May 2022 - Aug. 2022",
      "title": "Research Assistant"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "C",
      "AWS",
      "Docker",
      "WSL",
      "Postman"
    ],
    "familiar": [
      "Machine Learning",
      "Python ML Libraries (NumPy, TensorFlow, Pytorch, Scikit-learn, Gensim)",
      "Flask, Django",
      "Figma",
      "Jenkins",
      "Jira"
    ],
    "proficient": [
      "React/React Native",
      "Node.js/Next.js",
      "HTML/CSS",
      "TypeScript/JavaScript",
      "C++",
      "Java",
      "Spring Boot",
      "Linux/Bash",
      "PostgreSQL/SQL",
      "Agile/Scrum",
      "Git",
      "REST APIs",
      "Maven"
    ]
  },
  "summary": "I'm a graduate from the University of Toronto with a Bachelor of Science in Computer Science and Mathematics. I'm a full-stack developer who gained practical experience through my one-year internship at SS\u0026C Technologies, volunteer work in a small team with the charity United for Literacy, and personal projects. Majority of the projects I've worked on have used React/React Native for the frontend and various backend tools such as Next.js, Java Spring Boot, and Django. C++ is my personal favourite language to use where I've been using it since high school to solve competitive programming problems and course projects such as a lightweight networking stack and basic computer graphics using OpenGL. Overall, I bring substantial hands-on experience in software development through my undergrad that I hope to leverage to succeed in my early career."
}
